# Задача 25. Напишите программу, которая будет преобразовывать десятичное число в двоичное.
# Пример:
# - 45 -> 101101
# - 3 -> 11
# - 2 -> 10

num = int(input('Введите число: '))
num_bi = ''
x = int(num)
for i in (0, 1):
	while x > 0:
		a = x % 2
		x //= 2
		num_bi = str(a) + num_bi
print(num, '->', num_bi)